Revit 2026 API

# MaterialNodeColor Property

---

The color the material is being rendered at

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Color Color { get; }
```
```vb
Public ReadOnly Property Color As Color
	Get
```
```cpp
public:
property Color^ Color {
	Color^ get ();
}
```
```fsharp
member Color : Color with get
```

#### Property Value

Color

The value may differ from the default color property of the material, because it might have been overridden by rendering settings.

#### Reference

MaterialNode Class

Autodesk.Revit.DB Namespace